Revit 2027 API
RevisionNumbering Enumeration
 The options for how revision numbers should be displayed on sheets within a project.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum RevisionNumbering
Public Enumeration RevisionNumbering
public enum class RevisionNumbering
type RevisionNumbering
Members
Member name | Value | Description
PerProject | 0 |  The revision numbers on a sheet will match the global Revision Sequence Number assigned to the revision.
PerSheet | 1 |  The revisions on a given sheet will be automatically assigned a consecutive sequence for their revision numbers displayed on that sheet.
See Also
Reference
Autodesk.Revit.DB Namespace